In [185]:
# ! pip install seaborn

In [186]:
import numpy as np
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
# titanic.tail()
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [187]:
titanic = titanic[['survived','sex','age','pclass']]
titanic.dropna(axis=0,inplace=True)
titanic

     survived     sex   age  pclass
0           0    male  22.0       3
1           1  female  38.0       1
2           1  female  26.0       3
3           1  female  35.0       1
4           0    male  35.0       3
..        ...     ...   ...     ...
885         0  female  39.0       3
886         0    male  27.0       2
887         1  female  19.0       1
889         1    male  26.0       1
890         0    male  32.0       3

[714 rows x 4 columns]

In [188]:
titanic['sex'].replace(["male","female"],[0,1],inplace=True)
titanic

     survived  sex   age  pclass
0           0    0  22.0       3
1           1    1  38.0       1
2           1    1  26.0       3
3           1    1  35.0       1
4           0    0  35.0       3
..        ...  ...   ...     ...
885         0    1  39.0       3
886         0    0  27.0       2
887         1    1  19.0       1
889         1    0  26.0       1
890         0    0  32.0       3

[714 rows x 4 columns]

In [189]:
y = titanic['survived']
X = titanic.drop(['survived'],axis=1)

In [190]:
from sklearn.neighbors import KNeighborsClassifier
model = KNeighborsClassifier()
model.fit(X,y)
model.score(X,y)

0.8417366946778712

In [191]:
def has_survived(model,pclass,sex,age):
    x = np.array([pclass,sex,age]).reshape(1,3)
    return model.predict(x)

p = has_survived(model,pclass=3,sex=0,age=60.0)
p

c:\Users\Administrateur\Desktop\formation\tp11\.venv\Lib\site-packages\sklearn\base.py:465: UserWarning: X does not have valid feature names, but KNeighborsClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)